const mobile = [
  {
    pattern: '^(86){0,1}1\\d{10}$',
    code: '86',
    text: '中国大陆',
    des: 'CN'
  },
  {
    pattern: '^(00){0,1}(886){1}0{0,1}[6,7,9](?:\\d{7}|\\d{8}|\\d{10})$',
    code: '886',
    text: '中国台湾',
    des: 'TW'
  },
  {
    pattern: '^(00){0,1}(852){1}0{0,1}[1,5,6,9](?:\\d{7}|\\d{8}|\\d{12})$',
    code: '852',
    text: '中国香港',
    des: 'HK'
  },
  {
    pattern: '^(00){0,1}(853){1}6\\d{7}$',
    code: '853',
    text: '中国澳门',
    des: 'MO'
  },
  {
    pattern: '^(00){0,1}(60){1}1\\d{8,9}$',
    code: '60',
    text: '马来西亚',
    des: 'MY'
  },
  {
    pattern: '^(00){0,1}(65){1}[13689]\\d{6,7}$',
    code: '65',
    text: '新加坡',
    des: 'SG'
  },
  {
    pattern: '^(00){0,1}(81){1}0{0,1}[7,8,9](?:\\d{8}|\\d{9})$',
    code: '81',
    text: '日本',
    des: 'JP'
  },
  {
    pattern: '^(00){0,1}(82){1}0{0,1}[7,1](?:\\d{8}|\\d{9})$',
    code: '82',
    text: '韩国',
    des: 'KR'
  },
  {
    pattern: '^(00){0,1}(1){1}\\d{10,12}$',
    code: '1',
    text: '美国',
    des: 'US'
  },
  {
    pattern: '^(00){0,1}(1){1}\\d{10}$',
    code: '1',
    text: '加拿大',
    des: 'CA'
  },
  {
    pattern: '^(00){0,1}(61){1}4\\d{8,9}$',
    code: '61',
    text: '澳大利亚',
    des: 'AU'
  },
  {
    pattern: '^(00){0,1}(64){1}[278]\\d{7,9}$',
    code: '64',
    text: '新西兰',
    des: 'NZ'
  },
  {
    pattern: '^(00){0,1}(355){1}\\d{6,15}$',
    code: '355',
    text: '阿尔希尼亚',
    des: 'AL'
  },
  {
    pattern: '^(00){0,1}(54){1}\\d{6,12}$',
    code: '54',
    text: '阿根廷',
    des: 'AR'
  },
  {
    pattern: '^(00){0,1}(971){1}\\d{6,12}$',
    code: '971',
    text: '阿联酋',
    des: 'AE'
  },
  {
    pattern: '^(00){0,1}(968){1}\\d{6,15}$',
    code: '968',
    text: '阿曼',
    des: 'OM'
  },
  {
    pattern: '^(00){0,1}(994){1}\\d{6,15}$',
    code: '994',
    text: '阿塞拜疆',
    des: 'AZ'
  },
  {
    pattern: '^(00){0,1}(353){1}\\d{6,12}$',
    code: '353',
    text: '爱尔兰',
    des: 'IE'
  },
  {
    pattern: '^(00){0,1}(20){1}\\d{6,12}$',
    code: '20',
    text: '埃及',
    des: 'EG'
  },
  {
    pattern: '^(00){0,1}(372){1}\\d{6,12}$',
    code: '372',
    text: '爱沙尼亚',
    des: 'EE'
  },
  {
    pattern: '^(00){0,1}(244){1}\\d{6,15}$',
    code: '244',
    text: '安哥拉',
    des: 'AO'
  },
  {
    pattern: '^(00){0,1}(43){1}\\d{6,12}$',
    code: '43',
    text: '奥地利',
    des: 'AT'
  },
  {
    pattern: '^(00){0,1}(675){1}\\d{6,15}$',
    code: '672',
    text: '巴布亚新几内亚',
    des: 'PG'
  },
  {
    pattern: '^(00){0,1}(1242){1}\\d{6,12}$',
    code: '1242',
    text: '巴哈马',
    des: 'BS'
  },
  {
    pattern: '^(00){0,1}(970){1}\\d{6,15}$',
    code: '970',
    text: '巴勒斯坦',
    des: 'PS'
  },
  {
    pattern: '^(00){0,1}(973){1}\\d{6,15}$',
    code: '973',
    text: '巴林',
    des: 'BH'
  },
  {
    pattern: '^(00){0,1}(507){1}\\d{6,12}$',
    code: '507',
    text: '巴拿马',
    des: 'PA'
  },
  {
    pattern: '^(00){0,1}(55){1}\\d{6,12}$',
    code: '55',
    text: '巴西',
    des: 'BR'
  },
  {
    pattern: '^(00){0,1}(375){1}\\d{6,12}$',
    code: '375',
    text: '白俄罗斯',
    des: 'BY'
  },
  {
    pattern: '^(00){0,1}(359){1}\\d{6,12}$',
    code: '359',
    text: '保加利亚',
    des: 'BG'
  },
  {
    pattern: '^(00){0,1}(229){1}\\d{6,15}$',
    code: '229',
    text: '贝宁',
    des: 'BJ'
  },
  {
    pattern: '^(00){0,1}(32){1}\\d{6,12}$',
    code: '32',
    text: '比利时',
    des: 'BE'
  },
  {
    pattern: '^(00){0,1}(51){1}\\d{6,12}$',
    code: '51',
    text: '秘鲁',
    des: 'PE'
  },
  {
    pattern: '^(00){0,1}(48){1}\\d{6,12}$',
    code: '48',
    text: '波兰',
    des: 'PL'
  },
  {
    pattern: '^(00){0,1}(591){1}\\d{6,15}$',
    code: '591',
    text: '玻利维亚',
    des: 'BO'
  },
  {
    pattern: '^(00){0,1}(501){1}\\d{6,12}$',
    code: '501',
    text: '伯利兹',
    des: 'BZ'
  },
  {
    pattern: '^(00){0,1}(226){1}\\d{6,15}$',
    code: '226',
    text: '布基纳法索',
    des: 'BF'
  },
  {
    pattern: '^(00){0,1}(240){1}\\d{6,15}$',
    code: '240',
    text: '赤道几内亚',
    des: 'GQ'
  },
  {
    pattern: '^(00){0,1}(45){1}\\d{6,12}$',
    code: '45',
    text: '丹麦',
    des: 'DK'
  },
  {
    pattern: '^(00){0,1}(49){1}1(\\d{5,6}|\\d{9,12})$',
    code: '49',
    text: '德国',
    des: 'DE'
  },
  {
    pattern: '^(00){0,1}(228){1}\\d{6,15}$',
    code: '228',
    text: '多哥',
    des: 'TG'
  },
  {
    pattern: '^(00){0,1}(7){1}[13489]\\d{9,11}$',
    code: '7',
    text: '俄罗斯',
    des: 'RU'
  },
  {
    pattern: '^(00){0,1}(33){1}(\\d{6}|\\d{8,9})$',
    code: '33',
    text: '法国',
    des: 'FR'
  },
  {
    pattern: '^(00){0,1}(63){1}[24579](\\d{7,9}|\\d{12})$',
    code: '63',
    text: '菲律宾',
    des: 'PH'
  },
  {
    pattern: '^(00){0,1}(358){1}\\d{6,12}$',
    code: '358',
    text: '芬兰',
    des: 'FI'
  },
  {
    pattern: '^(00){0,1}(238){1}\\d{6,15}$',
    code: '238',
    text: '佛得角',
    des: 'CV'
  },
  {
    pattern: '^(00){0,1}(220){1}\\d{6,15}$',
    code: '220',
    text: '冈比亚',
    des: 'GM'
  },
  {
    pattern: '^(00){0,1}(1473){1}\\d{6,15}$',
    code: '1473',
    text: '格兰纳达',
    des: 'GD'
  },
  {
    pattern: '^(00){0,1}(995){1}\\d{6,15}$',
    code: '995',
    text: '格鲁吉亚',
    des: 'GE'
  },
  {
    pattern: '^(00){0,1}(57){1}\\d{6,12}$',
    code: '57',
    text: '哥伦比亚',
    des: 'CO'
  },
  {
    pattern: '^(00){0,1}(506){1}\\d{6,15}$',
    code: '506',
    text: '哥斯达黎加',
    des: 'CR'
  },
  {
    pattern: '^(00){0,1}(592){1}\\d{6,15}$',
    code: '592',
    text: '圭亚那',
    des: 'GY'
  },
  {
    pattern: '^(00){0,1}(31){1}6\\d{8}$',
    code: '31',
    text: '荷兰',
    des: 'NL'
  },
  {
    pattern: '^(00){0,1}(504){1}\\d{6,15}$',
    code: '504',
    text: '洪都拉斯',
    des: 'HN'
  },
  {
    pattern: '^(00){0,1}(253){1}\\d{6,15}$',
    code: '253',
    text: '吉布提',
    des: 'DJ'
  },
  {
    pattern: '^(00){0,1}(996){1}\\d{6,12}$',
    code: '996',
    text: '吉尔吉斯斯坦',
    des: 'KG'
  },
  {
    pattern: '^(00){0,1}(224){1}\\d{6,15}$',
    code: '224',
    text: '几内亚',
    des: 'GN'
  },
  {
    pattern: '^(00){0,1}(245){1}\\d{6,15}$',
    code: '245',
    text: '几内亚比绍',
    des: 'GW'
  },
  {
    pattern: '^(00){0,1}(241){1}\\d{6,15}$',
    code: '241',
    text: '加蓬',
    des: 'GA'
  },
  {
    pattern: '^(00){0,1}(855){1}\\d{6,12}$',
    code: '855',
    text: '柬埔寨',
    des: 'KH'
  },
  {
    pattern: '^(00){0,1}(263){1}\\d{6,15}$',
    code: '263',
    text: '津巴布韦',
    des: 'ZW'
  },
  {
    pattern: '^(00){0,1}(237){1}\\d{6,15}$',
    code: '237',
    text: '喀麦隆',
    des: 'CM'
  },
  {
    pattern: '^(00){0,1}(974){1}\\d{6,12}$',
    code: '974',
    text: '卡塔尔',
    des: 'QA'
  },
  {
    pattern: '^(00){0,1}(1345){1}\\d{6,15}$',
    code: '1345',
    text: '开曼群岛',
    des: 'KY'
  },
  {
    pattern: '^(00){0,1}(385){1}\\d{6,15}$',
    code: '385',
    text: '克罗地亚',
    des: 'HR'
  },
  {
    pattern: '^(00){0,1}(269){1}\\d{6,15}$',
    code: '269',
    text: '科摩罗',
    des: 'KM'
  },
  {
    pattern: '^(00){0,1}(965){1}\\d{6,15}$',
    code: '965',
    text: '科威特',
    des: 'KW'
  },
  {
    pattern: '^(00){0,1}(254){1}\\d{6,15}$',
    code: '254',
    text: '肯尼亚',
    des: 'KE'
  },
  {
    pattern: '^(00){0,1}(371){1}\\d{6,15}$',
    code: '371',
    text: '拉脱维亚',
    des: 'LV'
  },
  {
    pattern: '^(00){0,1}(266){1}\\d{6,15}$',
    code: '266',
    text: '莱索托',
    des: 'LS'
  },
  {
    pattern: '^(00){0,1}(370){1}\\d{6,12}$',
    code: '370',
    text: '立陶宛',
    des: 'LT'
  },
  {
    pattern: '^(00){0,1}(352){1}\\d{6,12}$',
    code: '352',
    text: '卢森堡',
    des: 'LU'
  },
  {
    pattern: '^(00){0,1}(250){1}\\d{6,15}$',
    code: '250',
    text: '卢旺达',
    des: 'RW'
  },
  {
    pattern: '^(00){0,1}(40){1}\\d{6,12}$',
    code: '40',
    text: '罗马尼亚',
    des: 'RO'
  },
  {
    pattern: '^(00){0,1}(261){1}\\d{6,15}$',
    code: '261',
    text: '马达加斯加',
    des: 'MG'
  },
  {
    pattern: '^(00){0,1}(960){1}\\d{6,12}$',
    code: '960',
    text: '马尔代夫',
    des: 'MV'
  },
  {
    pattern: '^(00){0,1}(265){1}\\d{6,15}$',
    code: '265',
    text: '马拉维',
    des: 'MW'
  },
  {
    pattern: '^(00){0,1}(223){1}\\d{6,15}$',
    code: '223',
    text: '马里',
    des: 'ML'
  },
  {
    pattern: '^(00){0,1}(230){1}\\d{6,15}$',
    code: '230',
    text: '毛里求斯',
    des: 'MU'
  },
  {
    pattern: '^(00){0,1}(222){1}\\d{6,15}$',
    code: '222',
    text: '毛里塔尼亚',
    des: 'MR'
  },
  {
    pattern: '^(00){0,1}(976){1}\\d{6,12}$',
    code: '976',
    text: '蒙古',
    des: 'MN'
  },
  {
    pattern: '^(00){0,1}(373){1}\\d{6,15}$',
    code: '373',
    text: '摩尔多瓦',
    des: 'MD'
  },
  {
    pattern: '^(00){0,1}(212){1}\\d{6,12}$',
    code: '212',
    text: '摩洛哥',
    des: 'MA'
  },
  {
    pattern: '^(00){0,1}(258){1}\\d{6,15}$',
    code: '258',
    text: '莫桑比克',
    des: 'MZ'
  },
  {
    pattern: '^(00){0,1}(52){1}\\d{6,12}$',
    code: '52',
    text: '墨西哥',
    des: 'MX'
  },
  {
    pattern: '^(00){0,1}(264){1}\\d{6,15}$',
    code: '264',
    text: '纳米比亚',
    des: 'NA'
  },
  {
    pattern: '^(00){0,1}(27){1}\\d{6,12}$',
    code: '27',
    text: '南非',
    des: 'ZA'
  },
  {
    pattern: '^(00){0,1}(505){1}\\d{6,15}$',
    code: '505',
    text: '尼加拉瓜',
    des: 'NI'
  },
  {
    pattern: '^(00){0,1}(227){1}\\d{6,15}$',
    code: '227',
    text: '尼日尔',
    des: 'NE'
  },
  {
    pattern: '^(00){0,1}(234){1}\\d{6,12}$',
    code: '234',
    text: '尼日利亚',
    des: 'NG'
  },
  {
    pattern: '^(00){0,1}(47){1}\\d{6,12}$',
    code: '47',
    text: '挪威',
    dec: 'NO'
  },
  {
    pattern: '^(00){0,1}(351){1}\\d{6,12}$',
    code: '351',
    text: '葡萄牙',
    des: 'PT'
  },
  {
    pattern: '^(00){0,1}(46){1}[124-7](\\d{8}|\\d{10}|\\d{12})$',
    code: '46',
    text: '瑞典',
    des: 'SE'
  },
  {
    pattern: '^(00){0,1}(41){1}\\d{6,12}$',
    code: '41',
    text: '瑞士',
    des: 'CN'
  },
  {
    pattern: '^(00){0,1}(503){1}\\d{6,15}$',
    code: '503',
    text: '萨尔瓦多',
    des: 'SV'
  },
  {
    pattern: '^(00){0,1}(381){1}\\d{6,12}$',
    code: '381',
    text: '塞尔维亚',
    des: 'RS'
  },
  {
    pattern: '^(00){0,1}(232){1}\\d{6,15}$',
    code: '232',
    text: '塞拉利昂',
    des: 'SL'
  },
  {
    pattern: '^(00){0,1}(221){1}\\d{6,15}$',
    code: '221',
    text: '塞内加尔',
    des: 'SN'
  },
  {
    pattern: '^(00){0,1}(357){1}\\d{6,15}$',
    code: '357',
    text: '塞浦路斯',
    des: 'CY'
  },
  {
    pattern: '^(00){0,1}(248){1}\\d{6,15}$',
    code: '248',
    text: '塞舌尔',
    des: 'SC'
  },
  {
    pattern: '^(00){0,1}(966){1}\\d{6,12}$',
    code: '996',
    text: '沙特阿拉伯',
    des: 'SA'
  },
  {
    pattern: '^(00){0,1}(94){1}\\d{6,12}$',
    code: '94',
    text: '斯里兰卡',
    des: 'LK'
  },
  {
    pattern: '^(00){0,1}(421){1}\\d{6,15}$',
    code: '421',
    text: '斯洛伐克',
    des: 'SK'
  },
  {
    pattern: '^(00){0,1}(386){1}\\d{6,15}$',
    code: '386',
    text: '斯洛文尼亚',
    des: 'SI'
  },
  {
    pattern: '^(00){0,1}(268){1}\\d{6,15}$',
    code: '268',
    text: '斯威士兰',
    des: 'SZ'
  },
  {
    pattern: '^(00){0,1}(992){1}\\d{6,15}$',
    code: '992',
    text: '塔吉克斯坦',
    des: 'TJ'
  },
  {
    pattern: '^(00){0,1}(66){1}[13456789]\\d{7,8}$',
    code: '66',
    text: '泰国',
    des: 'TH'
  },
  {
    pattern: '^(00){0,1}(255){1}\\d{6,15}$',
    code: '255',
    text: '坦桑尼亚',
    dec: 'TZ'
  },
  {
    pattern: '^(00){0,1}(1868){1}\\d{6,15}$',
    code: '1868',
    text: '特立尼达和多巴哥',
    dec: 'TT'
  },
  {
    pattern: '^(00){0,1}(90){1}\\d{6,12}$',
    code: '90',
    text: '土耳其',
    dec: 'TR'
  },
  {
    pattern: '^(00){0,1}(993){1}\\d{6,15}$',
    code: '993',
    text: '土库曼斯坦',
    dec: 'TM'
  },
  {
    pattern: '^(00){0,1}(216){1}\\d{6,12}$',
    code: '216',
    text: '突尼斯',
    dec: 'TN'
  },
  {
    pattern: '^(00){0,1}(502){1}\\d{6,15}$',
    code: '502',
    text: '危地马拉',
    des: 'GT'
  },
  {
    pattern: '^(00){0,1}(58){1}\\d{6,12}$',
    code: '58',
    text: '委内瑞拉',
    des: 'VE'
  },
  {
    pattern: '^(00){0,1}(673){1}\\d{6,15}$',
    code: '673',
    text: '文莱',
    des: 'BN'
  },
  {
    pattern: '^(00){0,1}(256){1}\\d{6,15}$',
    code: '256',
    text: '乌干达',
    des: 'UG'
  },
  {
    pattern: '^(00){0,1}(380){1}[3-79]\\d{8,9}$',
    code: '380',
    text: '乌克兰',
    des: 'UA'
  },
  {
    pattern: '^(00){0,1}(598){1}\\d{6,15}$',
    code: '598',
    text: '乌拉圭',
    des: 'UY'
  },
  {
    pattern: '^(00){0,1}(998){1}\\d{6,15}$',
    code: '998',
    text: '乌兹别克斯坦',
    des: 'UZ'
  },
  {
    pattern: '^(00){0,1}(34){1}\\d{6,12}$',
    code: '34',
    text: '西班牙',
    des: 'ES'
  },
  {
    pattern: '^(00){0,1}(30){1}\\d{6,12}$',
    code: '30',
    text: '希腊',
    des: 'GR'
  },
  {
    pattern: '^(00){0,1}(36){1}\\d{6,12}$',
    code: '36',
    text: '匈牙利',
    des: 'HU'
  },
  {
    pattern: '^(00){0,1}(1876){1}\\d{6,15}$',
    code: '1876',
    text: '牙买加',
    dec: 'JM'
  },
  {
    pattern: '^(00){0,1}(967){1}\\d{6,15}$',
    code: '967',
    text: '也门',
    dec: 'YE'
  },
  {
    pattern: '^(00){0,1}(39){1}[37]\\d{8,11}$',
    code: '39',
    text: '意大利',
    des: 'IT'
  },
  {
    pattern: '^(00){0,1}(972){1}\\d{6,12}$',
    code: '972',
    text: '以色列',
    des: 'IL'
  },
  {
    pattern: '^(00){0,1}(91){1}\\d{6,12}$',
    code: '91',
    text: '印度',
    des: 'IN'
  },
  {
    pattern: '^(00){0,1}(62){1}[2-9]\\d{7,11}$',
    code: '62',
    text: '印度尼西亚',
    dec: 'ID'
  },
  {
    pattern: '^(00){0,1}(44){1}[347-9](\\d{8,9}|\\d{11,12})$',
    code: '44',
    text: '英国',
    des: 'UK'
  },
  {
    pattern: '^(00){0,1}(1284){1}\\d{6,12}$',
    code: '1284',
    text: '英属维尔京群岛',
    des: 'VG'
  },
  {
    pattern: '^(00){0,1}(962){1}\\d{6,12}$',
    code: '962',
    text: '约旦',
    des: 'JO'
  },
  {
    pattern: '^(00){0,1}(84){1}[1-9]\\d{6,9}$',
    code: '84',
    text: '越南',
    des: 'VN'
  },
  {
    pattern: '^(00){0,1}(260){1}\\d{6,15}$',
    code: '260',
    text: '赞比亚',
    des: 'ZM'
  },
  {
    pattern: '^(00){0,1}(235){1}\\d{6,15}$',
    code: '235',
    text: '乍得',
    des: 'TD'
  },
  {
    pattern: '^(00){0,1}(56){1}\\d{6,12}$',
    code: '56',
    text: '智利',
    des: 'CL'
  }
];

module.exports = mobile;
